{"keras_version": "2.1.6", "config": [{"config": {"kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "padding": "valid", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "filters": 32, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_4", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}